Repository: huixiangyang/arc-kit
Catalog: Sources/Features/Mouse/Domain/Resources/Localization/Mouse.xcstrings
Source language: en
Languages: zh_hans

# appProfile.uuRemote
source: UU Remote
zh_hans: UU 远程

# appProfile.bundleIDRequired
source: Cannot add an app profile without an app name and Bundle ID
zh_hans: 无法添加 App Profile：应用名称或 Bundle ID 为空

# appProfile.custom.settings
source: Custom Settings
zh_hans: 单独设置

# appProfile.follow.global
source: Use Default Settings
zh_hans: 使用默认参数

# appProfile.invalidBundleID
source: Mouse profile bundleIdentifier cannot be empty or have leading or trailing whitespace
zh_hans: 鼠标 Profile bundleIdentifier 不能为空或包含首尾空白

# appProfile.invalidName
source: Mouse profile name cannot be empty or have leading or trailing whitespace
zh_hans: 鼠标 Profile 名称不能为空或包含首尾空白

# appProfile.selfProfileRejected
source: Arc Kit cannot be added to its own mouse enhancement profiles
zh_hans: 不能把 Arc Kit 自己加入鼠标增强 App Profile

# appProfile.use.system.scrolling
source: No Enhancement
zh_hans: 不启用增强

# gesture.action.missing
source: No Action
zh_hans: 无动作

# gesture.app.windows
source: App Windows
zh_hans: 应用窗口

# gesture.back
source: Back
zh_hans: 返回

# gesture.down
source: Down
zh_hans: 向下

# gesture.forward
source: Forward
zh_hans: 前进

# gesture.hold.right.button.drag
source: Hold Right Button and Drag
zh_hans: 右键按住拖动

# gesture.left
source: Left
zh_hans: 向左

# gesture.mission.control
source: Mission Control
zh_hans: 调度中心

# gesture.mouse.gesture.bindings.cover.every.direction
source: Mouse gesture bindings must cover every direction exactly once
zh_hans: 鼠标手势绑定必须完整且每个方向只能出现一次

# gesture.mouse.gesture.distance.outside.current
source: Mouse gesture distance is outside the current schema's range
zh_hans: 鼠标手势触发距离超出当前 schema 允许范围

# gesture.right
source: Right
zh_hans: 向右

# gesture.show.desktop
source: Show Desktop
zh_hans: 显示桌面

# gesture.up
source: Up
zh_hans: 向上

# scroll.mouse.scroll.modifier.contains.unknown.bits
source: Mouse scroll modifier contains unknown bits
zh_hans: 鼠标滚动修饰键包含未知位

# tuning.duplicateModifier
source: Mouse scrolling actions cannot share the same modifier key
zh_hans: 鼠标滚动动作不能重复使用同一个修饰键

# tuning.horizontal.scrolling
source: Horizontal scrolling
zh_hans: 横向滚动

# tuning.mouse.acceleration.multiplier
source: Mouse acceleration multiplier
zh_hans: 鼠标加速倍率

# tuning.mouse.inertia.response.time.outside
source: Mouse inertia response time is outside the current schema's range
zh_hans: 鼠标惯性响应时间超出当前 schema 允许范围

# tuning.mouse.scroll.step
source: Mouse scroll step
zh_hans: 鼠标滚动步长

# tuning.mouse.speed.gain
source: Mouse speed gain
zh_hans: 鼠标速度增益

# tuning.outside.current.schema.s.range
source: %1$@ is outside the current schema's range
zh_hans: %1$@超出当前 schema 允许范围

# tuning.temporarily.disable.smoothing
source: Temporarily disable smoothing
zh_hans: 临时禁用平滑

# tuning.temporary.acceleration
source: Temporary acceleration
zh_hans: 临时加速

# validation.all.apps
source: All Apps
zh_hans: 所有应用

# validation.appBundleIDRequired
source: Mouse app profiles require an explicit bundleIdentifier
zh_hans: 鼠标 App Profile 必须绑定明确 bundleIdentifier

# validation.listed.apps
source: Listed Apps Only
zh_hans: 仅列表中的应用

# validation.mouse.app.profile.bundleIDs
source: Mouse app profile bundle identifiers must be unique
zh_hans: 鼠标 App Profile bundleIdentifier 不能重复

# validation.mouse.app.profile.ids.unique
source: Mouse app profile IDs must be unique
zh_hans: 鼠标 App Profile id 不能重复

# validation.selfProfileRejected
source: Mouse app profiles cannot include Arc Kit itself
zh_hans: 鼠标 App Profile 不允许包含 Arc Kit 自身

# appProfile.uuRemoteNote
source: UU Remote already reverses scrolling. Avoid reversing it twice.
zh_hans: UU 远程自带滚动翻转，避免重复翻转。
